//
//  ItemModel.swift
//  HW_SearchController_Collection
//
//  Created by Nataliia Storozheva on 21.06.2020.
//  Copyright © 2020 Nataliia Storozheva. All rights reserved.
//

import Foundation
struct ItemModel {
    let title: String
    let text: String
    
    static func itemData() -> [ItemModel] {
        return [
            ItemModel(title:"В Китае 1400-летнее дерево сделало двор монастыря золотым: фото",
                      text:"В китайский город Сиань каждую осень зеленые листья на 1400-летнем дереве гинкго превращаются в ярко-желтые и опадают на землю, покрывая территорию монастыря Гуаньинь золотым ковром. Об этом пишет CGTN в Facebook."),
            ItemModel(title:"Британец сделал предложение девушке на борту падающего самолета",
                      text:"Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы Крис Джинс хотел просить свою возлюбленную Кейси Кинчеллу стать его женой во время отдыха на Бали, однако угроза авиакатастрофы изменила его планы"),
            ItemModel(title:"Vodafone с 30 октября повысит два бюджетных тарифа",
                      text:"Количество предоставляемых услуг вырастет только в одном из них"),
            ItemModel(title:"Ученые объяснили, как определить женскую ложь",
                      text:"Американские специалисты установили, что женщины лгут чаще мужчин"),
            ItemModel(title:"Британец проплыл более семи километров, спасаясь от акулы",
                      text:"По словам ныряльщика Джона Крэйга, тигровая акула четырех метров в длину преследовала его, но не нападала"),
            ItemModel(title:"Международный зернотрейдер продал два элеватора в Украине",
                      text:"АТ Каргилл продала элеваторы в Харьковской и Кировоградской областях"),
            ItemModel(title:"В Николаевской области поймали на взятке сотрудника полиции - СБУ",
                      text:"Сотрудники СБУ задержали подозреваемого в центре города во время получения взятки"),
            ItemModel(title:"В Киеве похитившей младенца женщине избрали меру пресечения",
                      text:"20-летней киевлянке избрана мера пресечения в виде круглосуточного домашнего ареста с электронным средством контроля сроком на 60 суток"),
            ItemModel(title:"Гриневич просит Австрию развеять мифы о законе об образовании",
                      text:"Посол Австрии поблагодарила за объяснение сути украинского закона и подчеркнула, что консультации с представителями меньшинств очень важны")
        ]
    }
}
